app/controllers/pages_controller.rb

  def home
  	@nombre_completo = params[:nombre_completo]
  	@correo_electronico = params[:correo_electronico]
  	@edad_usuario = params[:edad_usuario]
    @clientes = Client.all
---
SELECT "clients".* FROM "clients"

  def x
    @aut = Auto.all
---
SELECT "autos".* FROM "autos"

  def guardar_cliente
    @nombre_completo = params[:nombre_completo]
    @correo_electronico = params[:correo_electronico]
    @edad_usuario = params[:edad_usuario]

    unless @nombre_completo.blank?
      Client.create({
        name: @nombre_completo,
        email: @correo_electronico,
        edad: @edad_usuario
      })
---
INSERT INTO "clients" ("name", "email", "edad", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Maria"], ["email", "maria@maria.cl"], ["edad", 25], ["created_at", "2016-10-18 04:31:56.149600"], ["updated_at", "2016-10-18 04:31:56.149600"]]

  def guardar_auto
    @modelo = params[:modelo]
    @marca = params[:marca]
    @kilometros = params[:kilometros]
      unless @modelo.blank?
      Auto.create({
        modelo: @modelo,
        marca: @marca,
        km: @kilometros
      })
---
INSERT INTO "autos" ("modelo", "marca", "km", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["modelo", "qq"], ["marca", "chery"], ["km", 89], ["created_at", "2016-10-18 05:22:43.205253"], ["updated_at", "2016-10-18 05:22:43.205253"]]